app/Http/Middleware/StartingPoint.php

select exists(select * from `script`) as `exists`
select * from `script` limit 1
---
    public function handle(Request $request, Closure $next)
    {

        $client_host = request()->getHttpHost();
        $filter_host = preg_replace('/^www\./', '', $client_host);

        try{
            if(Schema::hasTable("script") && DB::table('script')->exists()) {
                $script = DB::table('script')->first();