app/Http/Controllers/User/DashboardController.php

    public function __construct()
    {
        $cardApi = VirtualCardApi::first();
---
select * from `virtual_card_apis` limit 1

    public function index()
    {
        $page_title = __("Dashboard");
        $user = auth()->user();
        $baseCurrency = Currency::default();
        $transactions = Transaction::auth()->latest()->take(5)->get();
        $totalAddMoney = Transaction::auth()->addMoney()->where('status',1)->sum('request_amount');
        $virtualCards = activeCardData()['active_cards'];
        $totalGiftCards = GiftCard::auth()->count();
---
select * from `transactions` where `user_id` = 1 order by `created_at` desc limit 5
select sum(`request_amount`) as aggregate from `transactions` where `user_id` = 1 and `type` = 'ADD-MONEY' and `status` = 1
select count(*) as aggregate from `gift_cards` where `user_id` = 1