app/Http/Controllers/User/VirtualcardController.php

select * from `virtual_card_apis` limit 1
---
    public function __construct()
    {
        $cardApi = VirtualCardApi::first();

select * from `virtual_cards` where `user_id` = 1
select count(*) as aggregate from `virtual_cards` where `user_id` = 1
select * from `transaction_settings` where `slug` = 'virtual_card' and `status` = 1 limit 1
select * from `transaction_settings` where `slug` = 'reload_card' and `status` = 1 limit 1
select * from `transactions` where `user_id` = 1 and `type` = 'VIRTUAL-CARD' order by `created_at` desc limit 10
---
    public function index()
    {
        $page_title = __("Virtual Card");
        $myCards = VirtualCard::where('user_id',auth()->user()->id)->get();
        $totalCards = VirtualCard::where('user_id',auth()->user()->id)->count();
        $cardCharge = TransactionSetting::where('slug','virtual_card')->where('status',1)->first();
        $cardReloadCharge = TransactionSetting::where('slug','reload_card')->where('status',1)->first();
        $transactions = Transaction::auth()->virtualCard()->latest()->take(10)->get();

select * from `virtual_cards` where `id` = '1' and `is_active` = 1 limit 1
---
    public function cardBlockUnBlock(Request $request) {
        $validator = Validator::make($request->all(),[
            'status'                    => 'required|boolean',
            'data_target'               => 'required|string',
        ]);
        if ($validator->stopOnFirstFailure()->fails()) {
            $error = ['error' => $validator->errors()];
            return Response::error($error,null,400);
        }
        $validated = $validator->safe()->all();
        if($request->status == 1 ){
            $card = VirtualCard::where('id',$request->data_target)->where('is_active',1)->first();

select * from `virtual_cards` where `user_id` = 1 and `card_id` = 'VC-172433810065' limit 1
select * from `virtual_card_transactions` where `card_id` = 'VC-172434060123' order by `created_at` desc
---
    public function cardTransaction($card_id) {
        $user = auth()->user();
        $card = VirtualCard::where('user_id', $user->id)->where('card_id', $card_id)->first();

        if (!$card) {
            return back()->with('error', 'Card not found.');
        }

        $page_title = __("Virtual Card Transaction");
        $transactions = VirtualCardTransaction::where('card_id', $card->card_id)
        ->orderBy('created_at','desc')
        ->get();