app/Http/Helpers/helpers.php

select * from `admin_notifications` where `admin_id` != 1 and `type` in ('SIDE_NAV')
---
function get_admin_notifications()
{
    $admin = auth()->user();
    $notification_clear_at =   $admin->notification_clear_at;
    if ($notification_clear_at  == null) {
        $notifications = AdminNotification::notAuth()->getByType([NotificationConst::SIDE_NAV])->get();

select * from `user_wallets` where `user_id` = 1 limit 1
---
function authWalletBalance(){
    $wallet = UserWallet::where('user_id',auth()->user()->id)->first();

select * from `user_notifications` where `user_id` = 1 order by `created_at` desc limit 4
---
function get_user_notifications()
{
    $user = auth()->user();
    $notifications = UserNotification::auth()->latest()->take(4)->get();

select * from `languages` where `status` = 1 limit 1
---
function selectedLang(){
    $default_language = Language::where('status',GlobalConst::ACTIVE)->first();

select * from `languages` where `status` = 1 limit 1
---
function selectedLangDir(){
    if(session()->get('local')){
    $default_language = Language::where('code',session()->get('local'))->first();
    $default_language_dir = $default_language->dir ?? LanguageConst::NOT_REMOVABLE;
    }else{
        $default_language = Language::where('status',GlobalConst::ACTIVE)->first();

select * from `virtual_card_apis` limit 1
---
function virtual_card_system($name)
{
    $method = VirtualCardApi::first();

select count(*) as aggregate from `virtual_cards` where `user_id` = 1
select count(*) as aggregate from `virtual_cards` where `user_id` = 1 and `is_active` = 1
select count(*) as aggregate from `virtual_cards` where `user_id` = 1 and `is_active` = 0
---
 function activeCardData(){
    if(virtual_card_system('flutterwave') == "flutterwave"){
        $virtual_cards = VirtualCard::where('user_id',auth()->user()->id)->count();
        $active_cards =  VirtualCard::where('user_id',auth()->user()->id)->where('is_active',1)->count();
        $inactive_cards = VirtualCard::where('user_id',auth()->user()->id)->where('is_active',0)->count();