app/Http/Controllers/Admin/Auth/LoginController.php

    protected function authenticated(Request $request, $user)
    {
        $this->createLoginLog($user);
---
insert into `admin_login_logs` (`admin_id`, `ip`, `mac`, `city`, `country`, `longitude`, `latitude`, `timezone`, `browser`, `os`, `updated_at`, `created_at`) values (1, '::1', '', 'New Haven', 'United States', -72.92, 41.31, 'America/New_York', 'Chrome', 'Windows', '2024-08-30 19:41:12', '2024-08-30 19:41:12')