app/Http/Controllers/SiteController.php

    public function home(){
        $basic_settings = BasicSettings::first();
---
select * from `basic_settings` limit 1

    public function blogDetails($id,$slug){

        $categories = BlogCategory::active()->latest()->get();
        $blog = Blog::where('id',$id)->where('slug',$slug)->first();
---
select * from `blogs` where `id` = '3' and `slug` = 'entrepreneurial-success-with-virtual-credit-card-services' limit 1