app/Http/Controllers/Admin/VirtualCardController.php

    public function cardApi()
    {
        $page_title = __("Setup Virtual Card Api");
        $api = VirtualCardApi::first();
---
select * from `virtual_card_apis` limit 1

    public function transactionLogs()
    {
        $page_title = __("Virtual Card Logs");
        $transactions = Transaction::with(
          'user:id,firstname,lastname,email,username,full_mobile',
            'currency:id,name',
        )->where('type', 'VIRTUAL-CARD')->latest()->paginate(20);
---
select * from `transactions` where `type` = 'VIRTUAL-CARD' order by `created_at` desc limit 20 offset 0
select `id`, `firstname`, `lastname`, `email`, `username`, `full_mobile` from `users` where `users`.`id` in (1)
select count(*) as aggregate from `transactions` where `type` = 'VIRTUAL-CARD'

    public function show(){

        $cards = VirtualCard::all();
---
select * from `virtual_cards`

    public function cardTransaction( Request $request){

        $card = null;
        $transactions = null;

        if ($request->has('card_pan')) {
            $card = VirtualCard::where('card_pan', $request->input('card_pan'))->first();
            if ($card) {
                $transactions = VirtualCardTransaction::where('card_id', $card->card_id)->get();
---
select * from `virtual_cards` where `card_pan` = '400000550710807' limit 1
select * from `virtual_card_transactions` where `card_id` = 'VC-172433810065'

       public function storeCardTransaction(Request $request)
       {
           // 验证请求数据
           $request->validate([
               'card_id' => 'required|integer|exists:virtual_cards,id', // 使用 card_id 验证
               'amount' => 'required|numeric',
               'currency' => 'required|string',
               'status' => 'required|string',
               'product'=>'required|string',
               'reference' => 'nullable|string',
               'gateway_reference' => 'nullable|string',
               'response_message' => 'nullable|string',
           ]);

           // 查找对应的卡片
           $card = VirtualCard::find($request->card_id);

           // 创建交易记录
           $trxId = date('Ymd') . mt_rand(1000000000, 9999999999);

            VirtualCardTransaction::create([
                'card_id' => $card->card_id,
                'user_id' => $card->user_id, // 确保 user_id 被正确设置
                'amount' => $request->amount,
                'currency' => $request->currency,
                'status' => $request->status,
                'product'=>$request->product,
                'reference' => $request->reference,
                'gateway_reference' => $request->gateway_reference,
                'response_message' => $request->response_message,
                'trx_id' => $trxId,

            ]);
---
select * from `virtual_cards` where `virtual_cards`.`id` = '1' limit 1
insert into `virtual_card_transactions` (`card_id`, `user_id`, `amount`, `currency`, `status`, `product`, `reference`, `gateway_reference`, `response_message`, `trx_id`, `updated_at`, `created_at`) values ('VC-172433810065', 1, '2', 'USD', 'pending', 'Facebook Ads', '', '', '', '2024AugSatfppiWb6nE0', '2024-08-24 20:02:24', '2024-08-24 20:02:24')